# ensemble_model/config.pbtxt
name: "searcher"
platform: "ensemble"
max_batch_size: 1

input [
  {
    name: "Query"
    data_type: TYPE_STRING
    dims: [ -1,-1 ]
  },
  {
    name: "ElasticsearchQuery"
    data_type: TYPE_STRING
    dims: [ 1 ]
  },
  {
    name: "K"
    data_type: TYPE_INT32
    dims: [ 1 ]
  }
]

output [
  {
    name: "Responses"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "Qwen3-Embedding-4B"
      model_version: -1
      input_map {
        key: "Query"
        value: "Query"
      }
      output_map {
        key: "Embedding"
        value: "Embedding"
      }
    },
    {
      model_name: "es_fetcher"
      model_version: -1
      input_map {
        key: "ElasticsearchQuery"
        value: "ElasticsearchQuery"
      }
      input_map {
        key: "K"
        value: "K"
      }
      input_map {
        key: "Embedding"
        value: "Embedding"
      }
      output_map {
        key: "Responses"
        value: "Responses"
      }
    }
  ]
}
